versaloon/vsf_orig/vsf/hal/cpu/stm32/ebi/STM32_EBI.c
/***************************************************************************
 *   Copyright (C) 2009 - 2010 by Simon Qian <SimonQian@SimonQian.com>     *
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   You should have received a copy of the GNU General Public License     *
 *   along with this program; if not, write to the                         *
 *   Free Software Foundation, Inc.,                                       *
 *   59 Temple Place - Suite 330, Boston, MA  02111-1307, USA.             *
 ***************************************************************************/

#include "app_type.h"
#include "vsfhal.h"

// TODO: remove MACROs below to stm32_reg.h
#define STM32_RCC_APB2ENR_IOPDEN		((uint32_t)1 << 5)
#define STM32_RCC_APB2ENR_IOPEEN		((uint32_t)1 << 6)
#define STM32_RCC_APB2ENR_IOPFEN		((uint32_t)1 << 7)
#define STM32_RCC_APB2ENR_IOPGEN		((uint32_t)1 << 8)

#define STM32_RCC_AHBENR_FSMC			((uint32_t)1 << 8)

#define STM32_FSMC_BCR_MBKEN			((uint32_t)1 << 0)
#define STM32_FSMC_BCR_MUXEN			((uint32_t)1 << 1)
#define STM32_FSMC_BCR_MTYP_SRAM		((uint32_t)0 << 2)
#define STM32_FSMC_BCR_MTYP_PSRAM		((uint32_t)1 << 2)
#define STM32_FSMC_BCR_MTYP_NOR			((uint32_t)2 << 2)
#define STM32_FSMC_BCR_MWID_8			((uint32_t)0 << 4)
#define STM32_FSMC_BCR_MWID_16			((uint32_t)1 << 4)
#define STM32_FSMC_BCR_FACCEN			((uint32_t)1 << 6)
#define STM32_FSMC_BCR_BURSTEN			((uint32_t)1 << 8)
#define STM32_FSMC_BCR_WAITPOL			((uint32_t)1 << 9)
#define STM32_FSMC_BCR_WRAPMOD			((uint32_t)1 << 10)
#define STM32_FSMC_BCR_WAITCFG			((uint32_t)1 << 11)
#define STM32_FSMC_BCR_WREN				((uint32_t)1 << 12)
#define STM32_FSMC_BCR_WAITEN			((uint32_t)1 << 13)
#define STM32_FSMC_BCR_EXTMOD			((uint32_t)1 << 14)
#define STM32_FSMC_BCR_ASYNCWAIT		((uint32_t)1 << 15)
#define STM32_FSMC_BCR_CBURSTRW			((uint32_t)1 << 19)

#define STM32_FSMC_BTR_ACCMOD_A			((uint32_t)0 << 28)
#define STM32_FSMC_BTR_ACCMOD_B			((uint32_t)1 << 28)
#define STM32_FSMC_BTR_ACCMOD_C			((uint32_t)2 << 28)
#define STM32_FSMC_BTR_ACCMOD_D			((uint32_t)3 << 28)

#define STM32_FSMC_PCR_ECCEN			((uint32_t)1 << 6)
#define STM32_FSMC_PCR_PWID_8			((uint32_t)0 << 4)
#define STM32_FSMC_PCR_PWID_16			((uint32_t)1 << 4)
#define STM32_FSMC_PCR_PTYP_NAND		((uint32_t)1 << 3)
#define STM32_FSMC_PCR_PTYP_PCCARD		((uint32_t)0 << 3)
#define STM32_FSMC_PCR_PBKEN			((uint32_t)1 << 2)
#define STM32_FSMC_PCR_PWAITEN			((uint32_t)1 << 1)
#define STM32_FSMC_PCR_ECCPS_256		((uint32_t)0 << 17)
#define STM32_FSMC_PCR_ECCPS_512		((uint32_t)1 << 17)
#define STM32_FSMC_PCR_ECCPS_1024		((uint32_t)2 << 17)
#define STM32_FSMC_PCR_ECCPS_2048		((uint32_t)3 << 17)
#define STM32_FSMC_PCR_ECCPS_4096		((uint32_t)4 << 17)
#define STM32_FSMC_PCR_ECCPS_8192		((uint32_t)5 << 17)

#if VSFHAL_EBI_EN

#include "STM32_EBI.h"

// stm32_ebi connection
// A00 -- A05 : PF0  -- PF5
// A06 -- A09 : PF12 -- PF15
// A10 -- A15 : PG0  -- PG5
// A16 -- A18 : PD11 -- PD13
// A19 -- A22 : PE3  -- PE6
// A23        : PE2
// A24 -- A25 : PG13 -- PG14
// D00 -- D01 : PD14 -- PD15
// D02 -- D03 : PD0  -- PD1
// D04 -- D12 : PE7  -- PE15
// D13 -- D15 : PD8  -- PD10
// NOE        : PD4
// NWE        : PD5
// NWAIT      : PD6
// nor/psram
// CLK        : PD3
// NADV       : PB7
// NBL0       : PE0
// NBL1       : PE1
// NE1        : PD7
// NE2        : PG9
// NE3        : PG10
// NE4        : PG12
// nand
// NCE2       : PD7
// NCE3       : PG9
// INT2       : PG6
// INT3       : PG7
// ALE        : PD11
// CLE        : PD12
// pccard
// NIORD      : PF6
// NREG       : PF7
// NIOWR      : PF8
// CD         : PF9
// INTR       : PF10
// NIOS16     : PF11
// NCE4_1     : PG10
// NCE4_2     : PG11

vsf_err_t stm32_ebi_init(uint8_t index)
{
	// common signals
	// NOE, NWE, DATA, ADDRESS
	switch (index & 0x0F)
	{
	case 0:
		RCC->APB2ENR |= STM32_RCC_APB2ENR_IOPDEN | STM32_RCC_APB2ENR_IOPEEN | 
						STM32_RCC_APB2ENR_IOPFEN | STM32_RCC_APB2ENR_IOPGEN;
		RCC->AHBENR |= STM32_RCC_AHBENR_FSMC;
		
		// noe nwe
		GPIOD->CRL = (GPIOD->CRL & ~(0xFF << (4 * 4))) | 
							(uint32_t)0xBB << (4 * 4);
		
		// data gpio
		GPIOD->CRL = (GPIOD->CRL & ~(0xFF << (0 * 4))) | 
							(uint32_t)0xBB << (0 * 4);
		GPIOE->CRL = (GPIOE->CRL & ~(0x0F << (7 * 4))) | 
							(uint32_t)0x0B << (7 * 4);
		#if FSMC00_DATA_LEN == 8
		GPIOD->CRH = (GPIOD->CRH & ~(0xFF << ((14 - 8) * 4))) | 
							(uint32_t)0xBB << ((14 - 8) * 4);
		GPIOE->CRH = (GPIOE->CRH & ~(0xFFF << ((8 - 8) * 4))) | 
							(uint32_t)0xBBB << ((8 - 8) * 4);
		#elif FSMC00_DATA_LEN == 16
		GPIOD->CRH = (GPIOD->CRH & 0x00FFF000) | 0xBB000BBB;
		GPIOE->CRH = 0xBBBBBBBB;
		#else
		#error "FSMC00_DATA_LEN MUST be 8 or 16"
		#endif
		
		// address gpio
		GPIOF->CRL = (GPIOF->CRL & ~(0xFFFFFF << (0 * 4))) | 
							(uint32_t)0xBBBBBB << (0 * 4);
		GPIOF->CRH = (GPIOF->CRH & ~(0xFFFF << ((12 - 8) * 4))) | 
							(uint32_t)0xBBBB << ((12 - 8) * 4);
		GPIOG->CRL = (GPIOG->CRL & ~(0xFFFFFF << (0 * 4))) | 
							(uint32_t)0xBBBBBB << (0 * 4);
		#if FSMC00_ADDR_LEN < 16
		#error "FSMC00_ADDR_LEN MUST be >= 16"
		#elif FSMC00_ADDR_LEN < 17
		#elif FSMC00_ADDR_LEN < 18
		GPIOD->CRH = (GPIOD->CRH & ~(0x0F << ((11 - 8) * 4))) | 
							(uint32_t)0x0B << ((11 - 8) * 4);
		#elif FSMC00_ADDR_LEN < 19
		GPIOD->CRH = (GPIOD->CRH & ~(0xFF << ((11 - 8) * 4))) | 
							(uint32_t)0xBB << ((11 - 8) * 4);
		#elif FSMC00_ADDR_LEN < 20
		GPIOD->CRH = (GPIOD->CRH & ~(0xFFF << ((11 - 8) * 4))) | 
							(uint32_t)0xBBB << ((11 - 8) * 4);
		#elif FSMC00_ADDR_LEN < 21
		GPIOD->CRH = (GPIOD->CRH & ~(0xFFF << ((11 - 8) * 4))) | 
							(uint32_t)0xBBB << ((11 - 8) * 4);
		GPIOE->CRL = (GPIOE->CRL & ~(0x0F << (3 * 4))) | 
							(uint32_t)0x0B << (3 * 4);
		#elif FSMC00_ADDR_LEN < 22
		GPIOD->CRH = (GPIOD->CRH & ~(0xFFF << ((11 - 8) * 4))) | 
							(uint32_t)0xBBB << ((11 - 8) * 4);
		GPIOE->CRL = (GPIOE->CRL & ~(0xFF << (3 * 4))) | 
							(uint32_t)0xBB << (3 * 4);
		#elif FSMC00_ADDR_LEN < 23
		GPIOD->CRH = (GPIOD->CRH & ~(0xFFF << ((11 - 8) * 4))) | 
							(uint32_t)0xBBB << ((11 - 8) * 4);
		GPIOE->CRL = (GPIOE->CRL & ~(0xFFF << (3 * 4))) | 
							(uint32_t)0xBBB << (3 * 4);
		#elif FSMC00_ADDR_LEN < 24
		GPIOD->CRH = (GPIOD->CRH & ~(0xFFF << ((11 - 8) * 4))) | 
							(uint32_t)0xBBB << ((11 - 8) * 4);
		GPIOE->CRL = (GPIOE->CRL & ~(0xFFFF << (3 * 4))) | 
							(uint32_t)0xBBBB << (3 * 4);
		#elif FSMC00_ADDR_LEN < 25
		GPIOD->CRH = (GPIOD->CRH & ~(0xFFF << ((11 - 8) * 4))) | 
							(uint32_t)0xBBB << ((11 - 8) * 4);
		GPIOE->CRL = (GPIOE->CRL & ~(0xFFFFF << (2 * 4))) | 
							(uint32_t)0xBBBBB << (2 * 4);
		#elif FSMC00_ADDR_LEN < 26
		GPIOD->CRH = (GPIOD->CRH & ~(0xFFF << ((11 - 8) * 4))) | 
							(uint32_t)0xBBB << ((11 - 8) * 4);
		GPIOE->CRL = (GPIOE->CRL & ~(0xFFFFF << (2 * 4))) | 
							(uint32_t)0xBBBBB << (2 * 4);
		GPIOG->CRH = (GPIOG->CRH & ~(0x0F << ((13 - 8) * 4))) | 
							(uint32_t)0x0B << ((13 - 8) * 4);
		#elif FSMC00_ADDR_LEN < 27
		GPIOD->CRH = (GPIOD->CRH & ~(0xFFF << ((11 - 8) * 4))) | 
							(uint32_t)0xBBB << ((11 - 8) * 4);
		GPIOE->CRL = (GPIOE->CRL & ~(0xFFFFF << (2 * 4))) | 
							(uint32_t)0xBBBBB << (2 * 4);
		GPIOG->CRH = (GPIOG->CRH & ~(0xFF << ((13 - 8) * 4))) | 
							(uint32_t)0xBB << ((13 - 8) * 4);
		#else
		#error "FSMC00_ADDR_LEN MUST be < 27"
		#endif
		return VSFERR_NONE;
	default:
		return VSFERR_NOT_SUPPORT;
	}
}

vsf_err_t stm32_ebi_fini(uint8_t index)
{
	switch (index & 0x0F)
	{
	case 0:
		// noe nwe
		GPIOD->CRL = (GPIOD->CRL & ~(0xFF << (4 * 4))) | 
							(uint32_t)0x44 << (4 * 4);
		
