versaloon/vsf_orig/vsf/hal/cpu/stm32/ebi/STM32_EBI.c
		// data gpio
		GPIOD->CRL = (GPIOD->CRL & ~(0xFF << (0 * 4))) | 
							(uint32_t)0x44 << (0 * 4);
		GPIOE->CRL = (GPIOE->CRL & ~(0x0F << (7 * 4))) | 
							(uint32_t)0x04 << (7 * 4);
		#if FSMC00_DATA_LEN == 8
		GPIOD->CRH = (GPIOD->CRH & ~(0xFF << ((14 - 8) * 4))) | 
							(uint32_t)0x44 << ((14 - 8) * 4);
		GPIOE->CRH = (GPIOE->CRH & ~(0xFFF << ((8 - 8) * 4))) | 
							(uint32_t)0x444 << ((8 - 8) * 4);
		#elif FSMC00_DATA_LEN == 16
		GPIOD->CRH = (GPIOD->CRH & 0x00FFF000) | 0x44000444;
		GPIOE->CRH = 0x44444444;
		#else
		#error "FSMC00_DATA_LEN MUST be 8 or 16"
		#endif
		
		// address gpio
		GPIOF->CRL = (GPIOF->CRL & ~(0xFFFFFF << (0 * 4))) | 
							(uint32_t)0x444444 << (0 * 4);
		GPIOF->CRH = (GPIOF->CRH & ~(0xFFFF << ((12 - 8) * 4))) | 
							(uint32_t)0x4444 << ((12 - 8) * 4);
		GPIOG->CRL = (GPIOG->CRL & ~(0xFFFFFF << (0 * 4))) | 
							(uint32_t)0x444444 << (0 * 4);
		#if FSMC00_ADDR_LEN < 16
		#error "FSMC00_ADDR_LEN MUST be >= 16"
		#elif FSMC00_ADDR_LEN < 17
		#elif FSMC00_ADDR_LEN < 18
		GPIOD->CRH = (GPIOD->CRH & ~(0x0F << ((11 - 8) * 4))) | 
							(uint32_t)0x04 << ((11 - 8) * 4);
		#elif FSMC00_ADDR_LEN < 19
		GPIOD->CRH = (GPIOD->CRH & ~(0xFF << ((11 - 8) * 4))) | 
							(uint32_t)0x44 << ((11 - 8) * 4);
		#elif FSMC00_ADDR_LEN < 20
		GPIOD->CRH = (GPIOD->CRH & ~(0xFFF << ((11 - 8) * 4))) | 
							(uint32_t)0x444 << ((11 - 8) * 4);
		#elif FSMC00_ADDR_LEN < 21
		GPIOD->CRH = (GPIOD->CRH & ~(0xFFF << ((11 - 8) * 4))) | 
							(uint32_t)0x444 << ((11 - 8) * 4);
		GPIOE->CRL = (GPIOE->CRL & ~(0x0F << (3 * 4))) | 
							(uint32_t)0x04 << (3 * 4);
		#elif FSMC00_ADDR_LEN < 22
		GPIOD->CRH = (GPIOD->CRH & ~(0xFFF << ((11 - 8) * 4))) | 
							(uint32_t)0x444 << ((11 - 8) * 4);
		GPIOE->CRL = (GPIOE->CRL & ~(0xFF << (3 * 4))) | 
							(uint32_t)0x44 << (3 * 4);
		#elif FSMC00_ADDR_LEN < 23
		GPIOD->CRH = (GPIOD->CRH & ~(0xFFF << ((11 - 8) * 4))) | 
							(uint32_t)0x444 << ((11 - 8) * 4);
		GPIOE->CRL = (GPIOE->CRL & ~(0xFFF << (3 * 4))) | 
							(uint32_t)0x444 << (3 * 4);
		#elif FSMC00_ADDR_LEN < 24
		GPIOD->CRH = (GPIOD->CRH & ~(0xFFF << ((11 - 8) * 4))) | 
							(uint32_t)0x444 << ((11 - 8) * 4);
		GPIOE->CRL = (GPIOE->CRL & ~(0xFFFF << (3 * 4))) | 
							(uint32_t)0x4444 << (3 * 4);
		#elif FSMC00_ADDR_LEN < 25
		GPIOD->CRH = (GPIOD->CRH & ~(0xFFF << ((11 - 8) * 4))) | 
							(uint32_t)0x444 << ((11 - 8) * 4);
		GPIOE->CRL = (GPIOE->CRL & ~(0xFFFFF << (2 * 4))) | 
							(uint32_t)0x44444 << (2 * 4);
		#elif FSMC00_ADDR_LEN < 26
		GPIOD->CRH = (GPIOD->CRH & ~(0xFFF << ((11 - 8) * 4))) | 
							(uint32_t)0x444 << ((11 - 8) * 4);
		GPIOE->CRL = (GPIOE->CRL & ~(0xFFFFF << (2 * 4))) | 
							(uint32_t)0x44444 << (2 * 4);
		GPIOG->CRH = (GPIOG->CRH & ~(0x0F << ((13 - 8) * 4))) | 
							(uint32_t)0x04 << ((13 - 8) * 4);
		#elif FSMC00_ADDR_LEN < 27
		GPIOD->CRH = (GPIOD->CRH & ~(0xFFF << ((11 - 8) * 4))) | 
							(uint32_t)0x444 << ((11 - 8) * 4);
		GPIOE->CRL = (GPIOE->CRL & ~(0xFFFFF << (2 * 4))) | 
							(uint32_t)0x44444 << (2 * 4);
		GPIOG->CRH = (GPIOG->CRH & ~(0xFF << ((13 - 8) * 4))) | 
							(uint32_t)0x44 << ((13 - 8) * 4);
		#else
		#error "FSMC00_ADDR_LEN MUST be < 27"
		#endif
		
		RCC->AHBENR &= ~STM32_RCC_AHBENR_FSMC;
		return VSFERR_NONE;
	default:
		return VSFERR_NOT_SUPPORT;
	}
}

static vsf_err_t stm32_ebi_config_sram_psram_nor(uint8_t index,
										uint32_t control, uint32_t timing,
										struct ebi_sram_psram_nor_info_t *info)
{
	uint8_t target_index = (index >> 6) & 0x0F;
	uint32_t bcr = control | STM32_FSMC_BCR_WREN | STM32_FSMC_BCR_MBKEN;
	uint32_t btr = timing, bwtr = timing;
	uint8_t clkdiv;
	struct stm32_info_t *cpu_info;
	
#if __VSF_DEBUG__
	if ((NULL == info) || 
		(info->param.address_setup_cycle_r < 1) || 
		(info->param.address_setup_cycle_r > 16) || 
		(info->param.address_hold_cycle_r < 2) || 
		(info->param.address_hold_cycle_r > 16) || 
		(info->param.data_setup_cycle_r < 2) || 
		(info->param.data_setup_cycle_r > 256) || 
		(info->param.address_setup_cycle_w < 1) || 
		(info->param.address_setup_cycle_w > 16) || 
		(info->param.address_hold_cycle_w < 2) || 
		(info->param.address_hold_cycle_w > 16) || 
		(info->param.data_setup_cycle_w < 2) || 
		(info->param.data_setup_cycle_w > 256))
	{
		return VSFERR_INVALID_RANGE;
	}
#endif
	if (stm32_get_info(&cpu_info))
	{
		return VSFERR_FAIL;
	}
	
	switch (index & 0x0F)
	{
	case 0:
		switch (target_index)
		{
		case 0:
			GPIOD->CRL = (GPIOD->CRL & ~(0x0F << (7 * 4))) | 
							(uint32_t)stm32_GPIO_AFPP << (7 * 4);
			break;
		case 1:
			GPIOG->CRH = (GPIOG->CRH & ~(0x0F << ((9 - 8) * 4))) | 
							(uint32_t)stm32_GPIO_AFPP << ((9 - 8) * 4);
			break;
		case 2:
			GPIOG->CRH = (GPIOG->CRH & ~(0x0F << ((10 - 8) * 4))) | 
							(uint32_t)stm32_GPIO_AFPP << ((10 - 8) * 4);
			break;
		case 3:
			GPIOG->CRH = (GPIOG->CRH & ~(0x0F << ((12 - 8) * 4))) | 
							(uint32_t)stm32_GPIO_AFPP << ((12 - 8) * 4);
			break;
		default:
			return VSFERR_NOT_SUPPORT;
		}
		
		if (info->param.timing.clock_hz_r)
		{
			GPIOB->CRL = (GPIOB->CRL & ~(0x0F << (7 * 4))) | 
							(uint32_t)stm32_GPIO_AFPP << (7 * 4);
		}
		
		if (info->param.addr_multiplex)
		{
			GPIOD->CRL = (GPIOD->CRL & ~(0x0F << (3 * 4))) | 
							(uint32_t)stm32_GPIO_AFPP << (3 * 4);
			bcr |= STM32_FSMC_BCR_MUXEN;
		}
		
		if (info->common_info.wait_signal != EBI_WAIT_NONE)
		{
			GPIOD->CRL = (GPIOD->CRL & ~(0x0F << (6 * 4))) | 
							(uint32_t)stm32_GPIO_INP << (6 * 4);
			GPIOD->BSRR = (uint32_t)1 << 6;
			
			switch (info->common_info.wait_signal)
			{
			case EBI_WAIT_POLHIGH_VI:
				bcr |= STM32_FSMC_BCR_WAITEN | STM32_FSMC_BCR_WAITPOL | 
						STM32_FSMC_BCR_WAITCFG;
				break;
			case EBI_WAIT_POLHIGH_VN:
				bcr |= STM32_FSMC_BCR_WAITEN | STM32_FSMC_BCR_WAITPOL;
				break;
			case EBI_WAIT_POLLOW_VI:
				bcr |= STM32_FSMC_BCR_WAITEN | STM32_FSMC_BCR_WAITCFG;
				break;
			case EBI_WAIT_POLLOW_VN:
				bcr |= STM32_FSMC_BCR_WAITEN;
				break;
			default:
				return VSFERR_INVALID_PARAMETER;
			}
		}
		
		if (8 == info->common_info.data_width)
		{
			bcr |= STM32_FSMC_BCR_MWID_8;
		}
		else if (16 == info->common_info.data_width)
		{
			bcr |= STM32_FSMC_BCR_MWID_16;
		}
		else
		{
			return VSFERR_INVALID_PARAMETER;
		}
		
		if (info->param.timing.clock_hz_r)
		{
			clkdiv = cpu_info->ahb_freq_hz / info->param.timing.clock_hz_r;
			if ((clkdiv < 2) || (clkdiv > 16))
			{
				return VSFERR_INVALID_RANGE;
			}
			clkdiv--;
		}
		else
		{
			clkdiv = 0;
		}
		btr |= (((info->param.timing.address_setup_cycle_r - 1) & 0x0F) << 0) | 
				(((info->param.timing.address_hold_cycle_r - 1) & 0x0F) << 4) | 
				(((info->param.timing.data_setup_cycle_r - 1) & 0xFF) << 8) | 
				((clkdiv & 0x0F) << 20);
		
		if ((info->param.timing.clock_hz_w != info->param.timing.clock_hz_r) || 
			(info->param.timing.address_setup_cycle_w != 
								info->param.timing.address_setup_cycle_r) || 
			(info->param.timing.address_hold_cycle_w != 
	 							info->param.timing.address_hold_cycle_r) || 
			(info->param.timing.data_setup_cycle_w != 
	 							info->param.timing.data_setup_cycle_r))
		{
			bcr |= STM32_FSMC_BCR_EXTMOD;
			if (info->param.timing.clock_hz_w)
			{
				clkdiv = cpu_info->ahb_freq_hz / info->param.timing.clock_hz_w;
			}
			else
			{
				clkdiv = 0;
			}
			bwtr |= (((info->param.timing.address_setup_cycle_w - 1) & 0x0F) << 0) | 
					(((info->param.timing.address_hold_cycle_w - 1) & 0x0F) << 4) | 
					(((info->param.timing.data_setup_cycle_w - 1) & 0xFF) << 8) | 
					((clkdiv & 0x0F) << 20);
		}
		else
		{
			bwtr = 0x0FFFFFFF;
		}
		
