versaloon/vsf_orig/vsf/hal/cpu/stm32/ebi/STM32_EBI.c
		FSMC_Bank1->BTCR[(target_index << 1) + 1] = btr;
		FSMC_Bank1E->BWTR[(target_index << 1) + 0] = bwtr;
		FSMC_Bank1->BTCR[(target_index << 1) + 0] = bcr;
		return VSFERR_NONE;
	default:
		return VSFERR_NOT_SUPPORT;
	}
}

vsf_err_t stm32_ebi_config_nor(uint8_t index,
								struct ebi_sram_psram_nor_info_t *info)
{
	return stm32_ebi_config_sram_psram_nor(index,
				STM32_FSMC_BCR_MTYP_NOR | STM32_FSMC_BCR_FACCEN,
				STM32_FSMC_BTR_ACCMOD_B, info);
}

vsf_err_t stm32_ebi_config_sram(uint8_t index,
								struct ebi_sram_psram_nor_info_t *info)
{
	GPIOE->CRL = (GPIOE->CRL & ~(0xFF << (0 * 4))) | 
							(uint32_t)0xBB << (0 * 4);
	return stm32_ebi_config_sram_psram_nor(index,
				STM32_FSMC_BCR_MTYP_SRAM,
				STM32_FSMC_BTR_ACCMOD_B, info);
}

vsf_err_t stm32_ebi_config_psram(uint8_t index,
									struct ebi_sram_psram_nor_info_t *info)
{
	GPIOE->CRL = (GPIOE->CRL & ~(0xFF << (0 * 4))) | 
							(uint32_t)0xBB << (0 * 4);
	return stm32_ebi_config_sram_psram_nor(index,
				STM32_FSMC_BCR_MTYP_PSRAM,
				STM32_FSMC_BTR_ACCMOD_B, info);
}

vsf_err_t stm32_ebi_config_nand(uint8_t index, struct ebi_nand_info_t *info)
{
	uint8_t bank_index = (index >> 4) & 0x03;
	uint32_t pcr = STM32_FSMC_PCR_PTYP_NAND | STM32_FSMC_PCR_PBKEN;
	uint32_t pmem = 0, patt = 0;
	
#if __VSF_DEBUG__
	if ((NULL == info) || 
		(info->param.timing.ale_to_re_cycle < 1) || 
		(info->param.timing.ale_to_re_cycle > 16) || 
		(info->param.timing.cle_to_re_cycle < 1) || 
		(info->param.timing.cle_to_re_cycle > 16))
	{
		return VSFERR_INVALID_PARAMETER;
	}
#endif
	
	switch (index & 0x0F)
	{
	case 0:
		// ALE & CLE
		GPIOD->CRH = (GPIOD->CRH & ~(0xFF << ((11 - 8) * 4))) | 
						(uint32_t)0xBB << ((11 - 8) * 4);
		
		switch (bank_index)
		{
		case 1:
			GPIOD->CRL = (GPIOD->CRL & ~(0x0F << (7 * 4))) | 
							(uint32_t)stm32_GPIO_AFPP << (7 * 4);
			GPIOG->CRL = (GPIOG->CRL & ~(0x0F << (6 * 4))) | 
							(uint32_t)stm32_GPIO_INP << (6 * 4);
			GPIOG->BSRR = (uint32_t)1 << 6;
			break;
		case 2:
			GPIOG->CRH = (GPIOG->CRH & ~(0x0F << ((9 - 8) * 4))) | 
							(uint32_t)stm32_GPIO_AFPP << ((9 - 8) * 4);
			GPIOG->CRL = (GPIOG->CRL & ~(0x0F << (7 * 4))) | 
							(uint32_t)stm32_GPIO_INP << (7 * 4);
			GPIOG->BSRR = (uint32_t)1 << 7;
			break;
		default:
			return VSFERR_NOT_SUPPORT;
		}
		
		pcr |= (((info->param.timing.ale_to_re_cycle - 1) & 0x0F) << 13) | 
				(((info->param.timing.cle_to_re_cycle - 1) & 0x0F) << 9);
		if (info->param.ecc.ecc_enable)
		{
			pcr |= STM32_FSMC_PCR_ECCEN;
			switch (info->param.ecc.ecc_page_size)
			{
			case 256:
				pcr |= STM32_FSMC_PCR_ECCPS_256;
				break;
			case 512:
				pcr |= STM32_FSMC_PCR_ECCPS_512;
				break;
			case 1024:
				pcr |= STM32_FSMC_PCR_ECCPS_1024;
				break;
			case 2048:
				pcr |= STM32_FSMC_PCR_ECCPS_2048;
				break;
			case 4096:
				pcr |= STM32_FSMC_PCR_ECCPS_4096;
				break;
			case 8192:
				pcr |= STM32_FSMC_PCR_ECCPS_8192;
				break;
			default:
				return VSFERR_INVALID_PARAMETER;
			}
		}
		
		if (info->common_info.wait_signal != EBI_WAIT_NONE)
		{
			GPIOD->CRL = (GPIOD->CRL & ~(0x0F << (6 * 4))) | 
							(uint32_t)0x0B << (6 * 4);
			pcr |= STM32_FSMC_PCR_PWAITEN;
		}
		
		if (8 == info->common_info.data_width)
		{
			pcr |= STM32_FSMC_PCR_PWID_8;
		}
		else if (16 == info->common_info.data_width)
		{
			pcr |= STM32_FSMC_PCR_PWID_16;
		}
		else
		{
			return VSFERR_INVALID_PARAMETER;
		}
		
		pmem = ((info->param.timing.setup_cycle - 1) << 0) | 
				((info->param.timing.wait_cycle - 1) << 8) | 
				(info->param.timing.hold_cycle << 16) | 
				(info->param.timing.hiz_cycle << 24);
		patt = ((info->param.timing.setup_cycle_attr - 1) << 0) | 
				((info->param.timing.wait_cycle_attr - 1) << 8) | 
				(info->param.timing.hold_cycle_attr << 16) | 
				(info->param.timing.hiz_cycle_attr << 24);
		
		switch (bank_index)
		{
		case 1:
			FSMC_Bank2->PMEM2 = pmem;
			FSMC_Bank2->PATT2 = patt;
			FSMC_Bank2->PCR2 = pcr;
			break;
		case 2:
			FSMC_Bank3->PMEM3 = pmem;
			FSMC_Bank3->PATT3 = patt;
			FSMC_Bank3->PCR3 = pcr;
			break;
		default:
			return VSFERR_NOT_SUPPORT;
		}
		return VSFERR_NONE;
	default:
		return VSFERR_NOT_SUPPORT;
	}
}

vsf_err_t stm32_ebi_config_sdram(uint8_t index, struct ebi_sdram_info_t *info)
{
	REFERENCE_PARAMETER(index);
	REFERENCE_PARAMETER(info);
	return VSFERR_FAIL;
}

vsf_err_t stm32_ebi_config_ddram(uint8_t index, struct ebi_ddram_info_t *info)
{
	REFERENCE_PARAMETER(index);
	REFERENCE_PARAMETER(info);
	return VSFERR_FAIL;
}

vsf_err_t stm32_ebi_config_pccard(uint8_t index, struct ebi_pccard_info_t *info)
{
#if __VSF_DEBUG__
	if (NULL == info)
	{
		return VSFERR_INVALID_PARAMETER;
	}
#endif
	
	switch (index & 0x0F)
	{
	case 0:
		return VSFERR_NONE;
	default:
		return VSFERR_NOT_SUPPORT;
	}
}

vsf_err_t stm32_ebi_config(uint8_t index, uint8_t target_index, void *param)
{
	uint8_t target_type = target_index & 0xF0;
	
	target_index &= 0x0F;
	switch (index)
	{
	case 0:
		switch (target_type)
		{
		case EBI_TGTTYP_NOR:
			return stm32_ebi_config_nor(
				(target_index & 0x03) << 6, (struct ebi_sram_psram_nor_info_t *)param);
		case EBI_TGTTYP_SRAM:
			return stm32_ebi_config_sram(
				(target_index & 0x03) << 6, (struct ebi_sram_psram_nor_info_t *)param);
		case EBI_TGTTYP_PSRAM:
			return stm32_ebi_config_psram(
				(target_index & 0x03) << 6, (struct ebi_sram_psram_nor_info_t *)param);
		case EBI_TGTTYP_NAND:
			return stm32_ebi_config_nand(
				((target_index + 1) & 0x03) << 4, (struct ebi_nand_info_t *)param);
		default:
			return VSFERR_NOT_SUPPORT;
		}
	default:
		return VSFERR_NOT_SUPPORT;
	}
}

void* stm32_ebi_get_base_addr(uint8_t index, uint8_t target_index)
{
	uint8_t target_type = target_index & 0xF0;
	
	target_index &= 0x0F;
	switch (index)
	{
	case 0:
		switch (target_type)
		{
		case EBI_TGTTYP_NOR:
			if (target_index > 3)
			{
				return NULL;
			}
			return (void *)(0x60000000 + target_index * 0x4000000);
		case EBI_TGTTYP_NAND:
			if (target_index > 1)
			{
				return NULL;
			}
			return (void *)(0x60000000 + (1 + target_index) * 0x10000000);
		default:
			return NULL;
		}
	default:
		return NULL;
	}
}

vsf_err_t stm32_ebi_isready(uint8_t index, uint8_t target_index)
{
	uint8_t target_type = target_index & 0xF0;
	
