versaloon/vsf_orig/vsf/hal/cpu/stm32/ebi/STM32_EBI.c
	target_index &= 0x0F;
	switch (index)
	{
	case 0:
		switch (target_type)
		{
		case EBI_TGTTYP_NOR:
			if (target_index > 3)
			{
				return VSFERR_NOT_SUPPORT;
			}
			return VSFERR_NONE;
		case EBI_TGTTYP_NAND:
			switch (target_index)
			{
			case 0:
				return GPIOG->IDR & (1UL << 6) ? VSFERR_NONE : VSFERR_NOT_READY;
			case 1:
				return GPIOG->IDR & (1UL << 7) ? VSFERR_NONE : VSFERR_NOT_READY;
			default:
				return VSFERR_NOT_SUPPORT;
			}
		default:
			return VSFERR_NOT_SUPPORT;
		}
	default:
		return VSFERR_NOT_SUPPORT;
	}
}

uint8_t stm32_ebi_read8(uint8_t index, uint32_t address)
{
	uint8_t target_index = (index >> 6) & 0x03;
	uint8_t bank_index = (index >> 4) & 0x03;
	
	address += 0x60000000 + (0x10000000 * bank_index);
	switch (bank_index)
	{
	case 0:
		address += target_index * 0x4000000;
	case 1:
	case 2:
	case 3:
		break;
	}
	return *(volatile uint8_t *)address;
}

void stm32_ebi_write8(uint8_t index, uint32_t address, uint8_t data)
{
	uint8_t target_index = (index >> 6) & 0x03;
	uint8_t bank_index = (index >> 4) & 0x03;
	
	address += 0x60000000 + (0x10000000 * bank_index);
	switch (bank_index)
	{
	case 0:
		address += target_index * 0x4000000;
	case 1:
	case 2:
	case 3:
		break;
	}
	*(volatile uint8_t *)address = data;
}

uint16_t stm32_ebi_read16(uint8_t index, uint32_t address)
{
	uint8_t target_index = (index >> 6) & 0x03;
	uint8_t bank_index = (index >> 4) & 0x03;
	
	address += 0x60000000 + (0x10000000 * bank_index);
	switch (bank_index)
	{
	case 0:
		address += target_index * 0x4000000;
	case 1:
	case 2:
	case 3:
		break;
	}
	return *(volatile uint16_t *)address;
}

void stm32_ebi_write16(uint8_t index, uint32_t address, uint16_t data)
{
	uint8_t target_index = (index >> 6) & 0x03;
	uint8_t bank_index = (index >> 4) & 0x03;
	
	address += 0x60000000 + (0x10000000 * bank_index);
	switch (bank_index)
	{
	case 0:
		address += target_index * 0x4000000;
	case 1:
	case 2:
	case 3:
		break;
	}
	*(volatile uint16_t *)address = data;
}

uint32_t stm32_ebi_read32(uint8_t index, uint32_t address)
{
	REFERENCE_PARAMETER(index);
	REFERENCE_PARAMETER(address);
	return 0;
}

void stm32_ebi_write32(uint8_t index, uint32_t address, uint32_t data)
{
	REFERENCE_PARAMETER(index);
	REFERENCE_PARAMETER(address);
	REFERENCE_PARAMETER(data);
}

vsf_err_t stm32_ebi_readp8(uint8_t index, uint32_t address, uint32_t count, 
						uint8_t *buff);
vsf_err_t stm32_ebi_readp8_isready(uint8_t index);
vsf_err_t stm32_ebi_writep8(uint8_t index, uint32_t address, uint32_t count, 
							uint8_t *buff);
vsf_err_t stm32_ebi_writep8_isready(uint8_t index);
vsf_err_t stm32_ebi_readp16(uint8_t index, uint32_t address, uint32_t count, 
							uint16_t *buff);
vsf_err_t stm32_ebi_readp16_isready(uint8_t index);
vsf_err_t stm32_ebi_writep16(uint8_t index, uint32_t address, uint32_t count, 
							uint16_t *buff);
vsf_err_t stm32_ebi_writep16_isready(uint8_t index);

vsf_err_t stm32_ebi_readp32(uint8_t index, uint32_t address, uint32_t count, 
							uint32_t *buff)
{
	REFERENCE_PARAMETER(index);
	REFERENCE_PARAMETER(address);
	REFERENCE_PARAMETER(count);
	REFERENCE_PARAMETER(buff);
	return VSFERR_FAIL;
}

vsf_err_t stm32_ebi_readp32_isready(uint8_t index)
{
	REFERENCE_PARAMETER(index);
	return VSFERR_FAIL;
}

vsf_err_t stm32_ebi_writep32(uint8_t index, uint32_t address, uint32_t count, 
							uint32_t *buff)
{
	REFERENCE_PARAMETER(index);
	REFERENCE_PARAMETER(address);
	REFERENCE_PARAMETER(count);
	REFERENCE_PARAMETER(buff);
	return VSFERR_FAIL;
}

vsf_err_t stm32_ebi_writep32_isready(uint8_t index)
{
	REFERENCE_PARAMETER(index);
	return VSFERR_FAIL;
}

vsf_err_t stm32_ebi_read(uint8_t index, uint8_t target_index, uint32_t address, 
						uint8_t data_size, uint8_t *buff, uint32_t count)
{
	uint32_t i;
	uint8_t target_type = target_index & 0xF0;
	
	target_index &= 0x0F;
	switch (index)
	{
	case 0:
		address += 0x60000000;
		switch (target_type)
		{
		case EBI_TGTTYP_NOR:
			address += (target_index & 0x03) * 0x4000000;
			break;
		case EBI_TGTTYP_NAND:
			address += (1 + (target_index & 0x01)) * 0x10000000;
			break;
		default:
			return VSFERR_NOT_SUPPORT;
		}
		
		switch (data_size)
		{
		case 1:
			for (i = 0; i < count; i++)
			{
				buff[i] = *(volatile uint8_t *)address;
				address += 1;
			}
			return VSFERR_NONE;
		case 2:
			for (i = 0; i < count; i++)
			{
				((uint16_t *)buff)[i] = *(volatile uint16_t *)address;
				address += 2;
			}
			return VSFERR_NONE;
		case 4:
			for (i = 0; i < count; i++)
			{
				((uint32_t *)buff)[i] = *(volatile uint32_t *)address;
				address += 4;
			}
			return VSFERR_NONE;
		default:
			return VSFERR_INVALID_PARAMETER;
		}
	default:
		return VSFERR_NOT_SUPPORT;
	}
}

vsf_err_t stm32_ebi_write(uint8_t index, uint8_t target_index, uint32_t address, 
						uint8_t data_size, uint8_t *buff, uint32_t count)
{
	uint32_t i;
	uint8_t target_type = target_index & 0xF0;
	
	target_index &= 0x0F;
	switch (index)
	{
	case 0:
		address += 0x60000000;
		switch (target_type)
		{
		case EBI_TGTTYP_NOR:
			address += (target_index & 0x03) * 0x4000000;
			break;
		case EBI_TGTTYP_NAND:
			address += (1 + (target_index & 0x01)) * 0x10000000;
			break;
		default:
			return VSFERR_NOT_SUPPORT;
		}
		
		switch (data_size)
		{
		case 1:
			for (i = 0; i < count; i++)
			{
				*(volatile uint8_t *)address = buff[i];
				address += 1;
			}
			return VSFERR_NONE;
		case 2:
			for (i = 0; i < count; i++)
			{
				*(volatile uint16_t *)address = ((uint16_t *)buff)[i];
				address += 2;
			}
			return VSFERR_NONE;
		case 4:
			for (i = 0; i < count; i++)
			{
				*(volatile uint32_t *)address = ((uint32_t *)buff)[i];
				address += 4;
			}
			return VSFERR_NONE;
		default:
			return VSFERR_INVALID_PARAMETER;
		}
	default:
		return VSFERR_NOT_SUPPORT;
	}
}

#endif
